<template>
  <div class="method">
    <!-- баннер -->
    <div class="img-banner">
      <img src="@/assets/img/payment_methods.png" alt srcset />
    </div>

    <!-- Главный загаловок -->
    <div class="payment-title">способы оплаты</div>

    <!-- круглые картинки с синими надписями -->
    <div class="img-text">
      <img src="@/assets/ui/credit-card 1.svg" alt />
      <div class="blue">Надедные и удобные способы оплаты</div>
    </div>
    <div class="img-text">
      <img src="@/assets/ui/team 1.svg" alt />
      <div class="blue">Работаем с физическими и юридическими лицами</div>
    </div>
    <div class="img-text">
      <img src="@/assets/ui/refund 1.svg" alt />
      <div class="blue">Гарантия возврата денежных средств</div>
    </div>

    <!-- миниатюрные картинки с чёрными падписями -->
    <div class="img-li">
      <img src="@/assets/ui/credit card 1.svg" alt />
      <div class="text">1. Оплата банковской картой</div>
    </div>

    <!-- описание -->
    <p>
      Для оплаты покупки Вы будете перенаправлены на платежный шлюз ОАО
      "Сбербанк России" для ввода реквизитов Вашей карты. Пожалуйста,
      приготовьте Вашу пластиковую карту заранее. Соединение с платежным шлюзом
      и передача информации осуществляется в защищенном режиме с использованием
      протокола шифрования SSL.
    </p>
    <p>
      В случае если Ваш банк поддерживает технологию безопасного проведения
      интернет-платежей Verified By Visa или MasterCard Secure Code для
      проведения платежа также может потребоваться ввод специального пароля.
      Способы и возможность получения паролей для совершения интернет-платежей
      Вы можете уточнить в банке, выпустившем карту.
    </p>
    <p>
      Настоящий сайт поддерживает 128-битное шифрование. Конфиденциальность
      сообщаемой персональной информации обеспечивается ОАО "Сбербанк России".
      Введенная информация не будет предоставлена третьим лицам за исключением
      случаев, предусмотренных законодательством РФ. Проведение платежей по
      банковским картам осуществляется в строгом соответствии с требованиями
      платежных систем Visa Int. и MasterCard Europe Sprl.
    </p>

    <!-- Синий заголовок картинка красный надпись -->
    <div class="blue">К оплате принимаем</div>
    <div class="cards">
      <img src="@/assets/ui/Credit cards 1.png" alt srcset />
    </div>
    <div class="red">
      Важно! Оплата банковской картой производится без комиссии.
    </div>

    <!-- миниатюрные картинки с чёрными падписями -->
    <div class="img-li">
      <img src="@/assets/ui/online-payment 1.svg" alt />
      <div class="text">2. Электронные способы оплаты через сайт</div>
    </div>

    <!-- описание -->
    <p>При оформлении заказа необходимо выбрать электронный способ оплаты.</p>
    <p>
      После подтверждения заказа менеджером в личном кабинете на странице «Мои
      заказы» напротив оформленного заказа появится кнопка «Оплатить заказ». Для
      оплаты вы будете направлены на сайт платежной системы.
    </p>

    <!-- Синий заголовок картинка красный надпись -->
    <div class="blue">
      Оплата производится при помощи платежной системы PayKeeper
    </div>
    <img
      class="card"
      src="@/assets/ui/Paykeeper платежная платформа 1.svg"
      alt
      srcset
    />
    <div class="red">
      Важно! Оплата банковской картой производится без комиссии.
    </div>

    <!-- описание -->
    <p>
      Оплатив покупку электронным способом, вы можете выбрать удобный вид
      доставки.
    </p>
    <p>
      При получении заказа обязательно предъявите документ, удостоверяющий
      личность (паспорт, водительские права,
    </p>
    <p>
      удостоверение личности военнослужащего, удостоверение личности моряка,
      загранпаспорт). Если заказ будет получать
    </p>
    <p>другой человек, необходима доверенность, заверенная нотариусом.</p>

    <!-- миниатюрные картинки с чёрными падписями -->
    <div class="img-li">
      <img src="@/assets/ui/bank-transfer 1.svg" alt />
      <div class="text">3. Банковский или почтовый перевод</div>
    </div>

    <!-- Описание -->
    <p>
      Необходимо заполнить бланк и осуществить почтовый перевод или оплатить
      счет, который выставляет менеджер, оформляющий ваш заказ.
    </p>

    <!-- предупреждение -->
    <div class="red">
      Важно! Будьте внимательны при заполнении реквизитов получателя платежа.
      Все платежные документы необходимо сохранять до момента получения товара.
    </div>

    <!-- миниатюрные картинки с чёрными падписями -->
    <div class="img-li">
      <img src="@/assets/ui/surface1.svg" alt />
      <div class="text">4. Безналичный расчет для юридических лиц</div>
    </div>

    <!-- Описание -->
    <p>
      Если покупка совершается от юридического лица, оплата производится по
      счету, который выставляет наш менеджер.
    </p>

    <!-- предупреждение -->
    <div class="red">
      Важно! Срок оплаты счета – до 3 дней. Возможно продление периода оплаты
      счета. Для этого необходимо связаться с персональным менеджером.
    </div>

    <!-- миниатюрные картинки с чёрными падписями -->
    <div class="img-li">
      <img src="@/assets/ui/refund 1.svg" alt />
      <div class="text">5. Возврат денежных средств или обмен товара</div>
    </div>

    <p>
      Для возврата платежа, совершенного через сайт,
      <router-link to="refund">заполните заявку.</router-link>
    </p>
  </div>
</template>

<script>
export default {
  name: "method"
};
</script>

<style lang="sass" scoped>
.img-banner
  max-width: 750px
  text-align: center
  margin: auto
  img
    width: 100%

.payment-title
  +afs(36px, 32px, 26px)
  margin: 2rem 0rem
  font-weight: 600

.img-text
  display: flex
  margin-bottom: 2rem
  align-items: center
  img
    width: 70px
    border-radius: 50%
    margin-right: 2rem

.blue
  color: $Blue
  margin-bottom: 1rem
  font-weight: 500

.red
  color: $Red
  margin-bottom: 1rem
  font-weight: 500

.img-li
  display: flex
  margin-top: 2rem
  margin-bottom: 1rem
  img
    width: 40px
    margin-right: .5rem
  .text
    +afs(24px,22px,20px)
    font-weight: 500


p
  padding-right: 1.5rem

.cards
  max-width: 450px
  margin-bottom: 1rem
  img
    width: 100%
</style>
