<template>
  <div class="refund">
    <div class="banner-img">
      <img src="@/assets/img/refund_money.png" alt="Возврат денег" />
    </div>

    <!-- Заголовок -->
    <div class="main-title">возврат денежных средств</div>

    <!-- пункт -->
    <div class="li">1. Процедура возврата денежных средств</div>

    <!-- описание -->
    <p>
      Возврат Покупателю денежных средств осуществляется в случае отказа от
      заказанного товара в момент до или после его получения и производится
      наличным или безналичным платежом, в зависимости от того, какое платёжное
      средство было выбрано при оплате товара (сроки возврата см. ниже). В
      случае возврата денежных средств по безналичному расчёту комиссия за
      данную операцию производится получателем платежа самостоятельно.
    </p>
    <p>
      Возврат денег осуществляется на основе письменного запроса или
      заполненного
      <a href="/refund.doc" download class="appBlank">
        <span class="link-text">бланка заявления (refund.doc[35KB])</span>
        <img src="@/assets/ui/download arrow.svg" alt="" /> </a
      >, отправленного по электронной почте на
      <router-link class="link-text" :to="{ name: 'Feedback' }">
        странице обратной связи
      </router-link>
      .
    </p>
    <p>
      I. В случае отказа от товара, оплаченного по безналичному расчёту
      (перечисление денежных средств в течение 7-10 дней после получения
      письменного запроса). В зависимости от способа, которым ранее был оплачен
      товар (банковский перевод, электронный платеж (электронные кошельки,
      банковские карты)), в письменном запросе необходимо указать следующую
      информацию:
    </p>
    <p>
      1. Номер заказа, номер электронного кошелька (полностью) / пластиковой
      карты (последние 4 цифры), ФИО получателя (полностью), оплатившего ранее
      заказ (если оплата была совершена через электронный кошелёк Yandex деньги,
      Web Money, банковскую карту).
    </p>
    <p>
      2. Номер заказа, ФИО получателя (полностью), № расчетного счета,
      наименование банка, № корреспондентского счета, ИНН получателя, БИК (если
      оплата была произведена через банковский перевод).
    </p>
    <p>
      II. В случае отказа от товара, оплаченного наличными средствами (передача
      денежных средств в течение 3-5 дней после подачи Покупателем письменного
      заявления): Данный порядок возврата денег действует, если Вы оплатили
      товар курьеру, доставлявшему товар. Возврат денег осуществляется при
      предъявлении письменного заявления с указанием причин возврата товара
      (ненадлежащее качество, претензии к качеству товара и др.), паспорта,
      товарного чека, гарантийного талона.
    </p>
    <p>
      Непосредственный возврат наличных денежных средств осуществляется 2
      способами:
    </p>
    <p>
      1. Наличными в офисе компании согласно правилам возврата товара в
      розничной торговле.
    </p>
    <p>2. Банковским переводом на расчетный счет или сберкнижку покупателя.</p>

    <!-- пункт -->
    <div class="li">2. Сроки возврата или обмена товара:</div>
    <p>
      При отказе от товаров надлежащего качества, имеющих товарный вид - возврат
      денежных средств или обмен на аналогичный товар, при условии наличия его
      на складе, осуществляется в течение 7 дней с момента получения товара, при
      условии, что товар подлежит обмену (согласно статье 25 Закона о защите
      прав потребителей, перечень товаров.)
    </p>

    <div class="red">
      Внимание! В случае отказа покупателя от товара надлежащего качества
      стоимость оплаченных покупателем транспортных расходов не возвращается.
    </div>

    <p>
      В случае отказа от товара ненадлежащего качества (к этой группе относятся
      все категории товаров) возврат денежных средств или обмен на аналогичный
      товар надлежащего качества, при условии наличия его на складе,
      осуществляется в течение 14 дней с момента приобретения товара.
    </p>
  </div>
</template>

<script>
export default {
  name: "refund"
};
</script>

<style lang="sass" scoped>
.banner-img
  max-width: 620px
  margin: auto
  img
    width: 100%

.main-title
  font-weight: 600
  +afs(36px, 32px, 26px)
  margin: 2rem 0rem

.li
  font-weight: 500
  margin-bottom: 1rem
  +afs(24px, 22px, 20px)

p
  padding-left: 1rem

.red
  color: $Red
  font-weight: 500
  margin-bottom: 1rem
  padding-left: 1rem

.appBlank
  display: inline

.link-text
  margin-right: .5rem
  font-style: italic
  color: $Blue
  padding-bottom: 3px
  border-bottom: 2px solid $Blue
</style>
