<template lang="pug">
main-layout
    .container
        .img  
            img(src="@/assets/img/Bunner.png", alt="alt")
        .wrapper-tab
            .tab-buttons 
                .tab(@click="tab = true" :class="{'active': tab}" ) {{title}}
                .tab(@click="tab = false" :class="{'active': !tab}") {{subtitle}}
            .tab-content 
                .content(ref="leaderWay" :class="{'active': tab}")    
                    p   Путь лидера. Трансформация происходит через получение участником базовых знаний и методологических основ по управлению от профессиональных тренеров и наставников. В результате полученных компетенций меняется ментальный уровень участника Проекта «Лидеры управления», и он начинает «творить» – создавать проекты, выводить их на уровень национальных корпораций.
                    p   Оттачивание управленческого мастерства происходит на платформах:Стратегия Победителя, Лидеры управления, Глобальная игра и ЦГиВИ.
                    p   Институт наставничества позволяет получить участнику управленческий опыт непосредственно от наставника.
                    p   Наставник – профессиональный управленец, сопровождает участника на протяжении всего пути личностного, профессионального и карьерного роста. Наставник выступает в качестве проводника, открывая участнику путь перехода с одного уровня ментальности на другой - более высокий. Почетная миссия наставника позволяет ему личным участием в Проекте внести свой вклад в развитие России.
                    p   Результатом командной профессиональной подготовки Проекта «Лидеры управления» будет являться формирование команд лидеров управления территорий и регионов, бизнеса (создание участниками 
                        span.blue РТК
                        |), способных вывести Россию на более высокий уровень своего экономического развития.  
                    .scheme
                        .h1 СХЕМА УПРАВЛЕНИЕ
                        img(src="@/assets/img/Схема.png", alt="alt")
                    .h1 Платформа 
                        span.blue   Институт Наставничества
                    p   Дает возможность участнику в формате интерактивного общения коммуницироваться на платформах: Стратегия Победителя, Лидеры управления, Глобальная игра и ЦГиВИ.
                    p.bold Стратегическая цель платформы Института Наставничества:
                    ol
                        li    Способствовать развитию института наставничества в России.
                        li    Способствовать передаче управленческого опыта между поколениями.
                        li    Способствовать «взращиванию» лидеров управления и формированию профессиональных команд управленцев развития территорий и регионов, бизнеса.
                    p.bold Задачи платформы Института Наставничества:
                    ol
                        li    Открыть возможность прямого интерактивного общения участника с выбранным наставником.
                        li    Развить у каждого участника лидерские качества и управленческое видение.
                        li    Развить коммуникативные навыки, снять «зажатость» и другие блоки, мешающие личному развитию.
                        li    Заложить участнику правильные управленческие установки для личностного развития.
                        li    Вывести участника на уровень личной 
                            span.blue  ментальности.
                        li    Сопровождение проектов.
                        li    Сопровождение бизнеса.
                    p   В процессе наставничества формируется 
                        span.blue  ЛСР наставника.
                    .h1 Платформа 
                        span.blue  Стратегия победителя
                    p   Выбор наставника происходит на этой платформе, участник сам выбирает наставника по 
                        span.blue  ЛРН
                        |  Лидер – участник, имеющий высокий 
                        span.blue  ЛР 
                        |  и 
                        span.blue  КР
                        |  . Единственным критерием оценки на платформе Стратегия Победителя является: «У тебя получилось!», то есть Прогнозный график на тренажере в Стратегии Победителя совпал с графиком твоего желаемого состояния, реализуемого в жизни.
                    p.bold Задачи платформы Стратегия Победителя:
                    ol
                        li   	Выявить и отобрать талантливых управленцев, обладающих лидерскими качествами от 6+, 14+,18+, спортсменов, завершивших спортивную карьеру.
                        li   	Развить системное, стратегическое мышление и когнитивные способности у этих целевых аудиторий.
                        li   	Вывести каждого участника на уровень построения своей успешной системы управления с получением желаемого состояния, затем на уровень создания проектов и бизнеса на платформах Лидеры управления и Глобальная игра.
                    .h1 Платформа 
                        span.blue  Центр Компетенций 
                    p.bold Задачи платформы Центра Компетенций:
                    p   Дать участникам базовые знания и методологические основы по управлению для построения своей системы управления с получением желаемого состояния, с последующим выведением участников на уровень создания проектов и бизнеса на платформах Лидеры управления и Глобальная игра.
                    .h1 Платформа 
                        span.blue  Лидеры Управления
                    p   Интерактивный тренажер по созданию и развитию проектов. Формирование управленческого навыка. В результате командной работы у каждого проекта формируется 
                        span.blue  ПР 
                        |  и 
                        span.blue  КР.
                    p.bold Задачи платформы Лидеры Управления:
                    ol
                        li   	Научить участников создавать инвестиционно-привлекательные и конкурентоспособные проекты.
                        li   	Показать эффективность командного управления и научиться работать в таких командах на приращение.
                        li   	Вывести каждого участника на уровень муниципального, регионального или федерального мышления в зависимости от его ментального уровня.
                    .h1 Платформа 
                        span.blue  Стратегические Сессии
                    p   Командная разработка лидирующей модели экономического развития бизнеса. На этом этапе формируется команда будущего бизнеса и происходит трансформация проекта в бизнес.
                    .h1 Платформа 
                        span.blue  Глобальная Игра  
                    p   Интерактивный тренажер по формированию эффективных управленческих команд 
                        span.blue  развития бизнеса 
                        | и территорий его нахождения.
                    p   На платформе проект становится клубом, а в жизни бизнесом, модель «клуб=бизнес». На платформе в результате отбора и профподготовки участников формируется эффективная команда клуба. Команда реализует проект в жизни, на платформе каждый клуб имеет организационный рейтинг 
                        span.blue  ОР.
                    .h1 Платформа 
                        span.blue  Центр Квалификации
                    p   Профессиональная подготовка команд лидеров управления , команд топ-менеджеров развития территорий и регионов, бизнеса.
                    p   Центр квалификации представлен 
                        span.blue  ВШ-МРТиР 
                        | и 
                        span.blue  УГУ.
                    .h1 Платформа 
                        span.blue  Центр горизонтальной и вертикальной интеграции
                    p   Региональный рейтинг 
                        span.blue  РР.

                .content(ref="concention" :class="{'active': !tab}")  
                    .h1 Стратегические цели:
                    ol
                        li    Повысить экономико-управленческую компетентность граждан.
                        li    Создать механизм выполнения Президентских инициатив.
                        li    «Взрастить» лидеров управления муниципального, регионального и федерального уровней.
                        li    Подготовить грамотный управленческий резерв социально-экономического развития муниципальных образований 14+: малое и среднее предпринимательство.
                        li    Участвовать в формировании молодежных команд профессиональных муниципальных управленцев высшей квалификации 18+: экономико-управленческий капитал развития территорий и регионов.
                        li    Развивать институт наставничества в России через формирование профессиональных команд наставников проектов и бизнеса: социальный капитал развития территорий и регионов.
                        li    Способствовать формированию профессиональных команд топ-менеджеров развития бизнеса и территорий его нахождения.
                        li    Создать благоприятную среду доверия граждан к управленческому корпусу муниципального, регионального, федерального уровня и к бизнесу.
                        li    Способствовать развитию РТК – что это?
</template>

<script>
export default {
  name: "leader-way",
  data() {
    return {
      title: "ПУТЬ ЛИДЕРА",
      subtitle: 'КОНЦЕПЦИЯ НАЦИОНАЛЬНОГО ПРОЭКТА "ЛИДЕРЫ УПРАВЛЕНИЯ"',
      tab: true
    };
  }
};
</script>

<style lang="sass" scoped>
.img
    margin-top: 2rem
    position: relative
    .text
        position: absolute
        top: 0.5em
        left: 0.5em
        +afs(4rem, 3rem, 2rem)
        color: $Blue
        text-shadow: 0px 1px 2px rgba(0, 57, 166, 0.24), 0px 2px 6px rgba(0, 57, 166, 0.16)
        font-weight: bold

img
    width: 100%

.wrapper-tab
    margin-top: 3rem
    box-shadow: 0px 7px 8px rgba(0,0,0,0.15), 2px 1px 2px rgba(0,0,0,0.15)
    border-top-left-radius: 1rem
    border-top-right-radius: 1rem
    margin-bottom: 2rem

.tab-buttons
    display: grid
    grid-template-columns: 1fr 1fr
    .tab
        display: grid
        align-items: center
        cursor: pointer
        padding: 1rem
        border-top-right-radius: 1rem
        border-top-left-radius: 1rem
        box-shadow: 0px 0px 7px rgba(0, 0, 0, 0.2), 0px 5px 15px rgba(0, 0, 0, 0.1)
        text-shadow: 0px 1px 2px rgba(8, 35, 48, 0.24), 0px 2px 6px rgba(8, 35, 48, 0.16)
        color: $LightGrey
        transition: .7s
        +afs(26px,18px,8px)
        &.active
            color: $Black
            box-shadow: -2px -1px 2px rgba(0,0,0,0), 2px -1px 2px rgba(0,0,0,0.2)
            font-weight: 600

.tab-content
    padding: 1rem
    .content
        display: none
        &.active
            display: block
        .scheme
            overflow-x: auto
            .h1
                +afs(30px, 20px, 16px)
                text-align: center
                margin: 2rem 0rem
            img
                min-width: 660px

p
    +afs(18px, 16px, 12px)

ol
    padding: 1rem
    li
        margin-bottom: .5rem
        +afs(18px, 16px, 12px)
.h1
    margin: 1rem 0rem
    +afs(24px, 20px, 14px)
    font-weight: 500
    text-transform: uppercase
span.blue
    color: $Blue
.bold
    font-weight: 500
</style>
